SimpleConf/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SimpleConf/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Procedure ТоварыКоличествоOnChange(Item)
	ТекущиеДанные = Элементы.Товары.CurrentData;
	ПересчитатьСуммуВСтроке(ТекущиеДанные);		
EndProcedure

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	ТекущиеДанные = Элементы.Товары.CurrentData;
	ПересчитатьСуммуВСтроке(ТекущиеДанные);	
EndProcedure

&НаКлиенте
Процедура ПересчитатьСуммуВСтроке(ТекущиеДанные)
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	ПересчитатьСуммуДокумента();	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуДокумента()

	Object.СуммаДокумента = Object.Товары.Total("Сумма"); 

КонецПроцедуры
